{
    "users": [
        {
            "id": 1,
            "username": "test",
            "password": "1234",
            "watched": [
                {
                    "movie_id": 13,
                    "rating": 5
                },
                {
                    "movie_id": 14,
                    "rating": null
                },
                {
                    "movie_id": 11,
                    "rating": null
                },
                {
                    "movie_id": 9,
                    "rating": null
                },
                {
                    "movie_id": 16,
                    "rating": null
                },
                {
                    "movie_id": 17,
                    "rating": null
                },
                {
                    "movie_id": 20,
                    "rating": null
                },
                {
                    "movie_id": 22,
                    "rating": null
                }
            ],
            "watchlist": [
                20
            ],
            "moods": []
        },
        {
            "id": 2,
            "username": "miruna",
            "password": "m",
            "watched": [
                {
                    "movie_id": 4,
                    "rating": null
                }
            ],
            "watchlist": [
                4
            ],
            "moods": []
        },
        {
            "id": 3,
            "username": "mir",
            "password": "1234",
            "watched": [],
            "watchlist": [],
            "moods": []
        },
        {
            "id": 4,
            "username": "miri",
            "password": "1234",
            "watched": [],
            "watchlist": [],
            "moods": []
        }
    ],
    "movies": [
        {
            "id": 4,
            "title": "Titanic",
            "description": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
            "poster_path": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
            "tmdb_id": 597
        },
        {
            "id": 5,
            "title": "Lilo & Stitch",
            "description": "The wildly funny and touching story of a lonely Hawaiian girl and the fugitive alien who helps to mend her broken family.",
            "poster_path": "/7c5VBuCbjZOk7lSfj9sMpmDIaKX.jpg",
            "tmdb_id": 552524
        },
        {
            "id": 6,
            "title": "Thunderbolts*",
            "description": "After finding themselves ensnared in a death trap, seven disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts.",
            "poster_path": "/hBH50Mkcrc4m8x73CovLmY7vBx1.jpg",
            "tmdb_id": 986056
        },
        {
            "id": 7,
            "title": "Titanic",
            "description": "Unhappily married, Julia Sturges decides to go to America with her two children on the Titanic. Her husband, Richard also arranges passage on the luxury liner so as to have custody of their two children. All this fades to insignificance once the ship hits an iceberg.",
            "poster_path": "/rEPzO9I6LCk6Mxg1X4BsBk6oA3V.jpg",
            "tmdb_id": 16535
        },
        {
            "id": 8,
            "title": "The Accountant²",
            "description": "When an old acquaintance is murdered, Wolff is compelled to solve the case. Realizing more extreme measures are necessary, Wolff recruits his estranged and highly lethal brother, Brax, to help. In partnership with Marybeth Medina, they uncover a deadly conspiracy, becoming targets of a ruthless network of killers who will stop at nothing to keep their secrets buried.",
            "poster_path": "/kMDUS7VmFhb2coRfVBoGLR8ADBt.jpg",
            "tmdb_id": 870028
        },
        {
            "id": 9,
            "title": "Meet Joe Black",
            "description": "Bill Parrish has it all - success, wealth and power. Days before his 65th birthday, he receives a visit from a mysterious stranger, Joe Black, who soon reveals himself as Death. In exchange for extra time, Bill agrees to serve as Joe's earthly guide. But will he regret his choice when Joe unexpectedly falls in love with Bill's beautiful daughter Susan?",
            "poster_path": "/fDPAjvfPMomkKF7cMRmL5Anak61.jpg",
            "tmdb_id": 297
        },
        {
            "id": 10,
            "title": "Meet Joe Black",
            "description": "",
            "poster_path": "/fDPAjvfPMomkKF7cMRmL5Anak61.jpg",
            "tmdb_id": 9
        },
        {
            "id": 11,
            "title": "Ocean's Eleven",
            "description": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess.",
            "poster_path": "/hQQCdZrsHtZyR6NbKH2YyCqd2fR.jpg",
            "tmdb_id": 161
        },
        {
            "id": 12,
            "title": "Ballerina",
            "description": "Taking place during the events of John Wick: Chapter 3 – Parabellum, Eve Macarro begins her training in the assassin traditions of the Ruska Roma.",
            "poster_path": "/2VUmvqsHb6cEtdfscEA6fqqVzLg.jpg",
            "tmdb_id": 541671
        },
        {
            "id": 13,
            "title": "Ballerina",
            "description": "",
            "poster_path": "/2VUmvqsHb6cEtdfscEA6fqqVzLg.jpg",
            "tmdb_id": 12
        },
        {
            "id": 14,
            "title": "Titanic",
            "description": "",
            "poster_path": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
            "tmdb_id": 4
        },
        {
            "id": 15,
            "title": "Titanic",
            "description": "",
            "poster_path": "/rEPzO9I6LCk6Mxg1X4BsBk6oA3V.jpg",
            "tmdb_id": 7
        },
        {
            "id": 16,
            "title": "F1",
            "description": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
            "poster_path": "/vqBmyAj0Xm9LnS1xe1MSlMAJyHq.jpg",
            "tmdb_id": 911430
        },
        {
            "id": 17,
            "title": "Superman",
            "description": "Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.",
            "poster_path": "/ombsmhYUqR4qqOLOxAyr5V8hbyv.jpg",
            "tmdb_id": 1061474
        },
        {
            "id": 18,
            "title": "Titanic",
            "description": "This documentary explores the incredible history of the Titanic. From the crew to its final hours, Titanic chronicles this incredible story like never before. Get ready for Titanic.",
            "poster_path": "/l7rAG4P16SNFdPmWfTC8ZQydOon.jpg",
            "tmdb_id": 1124589
        },
        {
            "id": 19,
            "title": "Titanic: Into the Heart of the Wreck",
            "description": "The Titanic is under a new threat. Resting at over 12,500 feet below sea level and 380 nautical miles off the coast of Newfoundland, the most famous shipwreck in the world is being consumed by a colony of iron-eating bacteria. This slow and irreversible decay, according to the most concerned experts, will sweep away all the secrets of the mythic liner within a few decades. This documentary details the underwater odyssey of the greatest Titanic expeditions and the evolution of the most scrutinized shipwreck in the world. From the epic discovery of the wreck by a French-American team in 1985 to the exploratory missions led by James Cameron, and to the treasure hunts that brought back over 5,000 vestiges–experience the unequaled thrill of these extreme dives through the eyes of the explorers who have attempted to unlock Titanic’s secrets.",
            "poster_path": "/sTqXfXdLtVBhWyo1kBG1xgtV946.jpg",
            "tmdb_id": 777797
        },
        {
            "id": 20,
            "title": "KPop Demon Hunters",
            "description": "When K-pop superstars Rumi, Mira and Zoey aren't selling out stadiums, they're using their secret powers to protect their fans from supernatural threats.",
            "poster_path": "/43c1efKzA1kigNzY0HBzeoXp8LR.jpg",
            "tmdb_id": 803796
        },
        {
            "id": 21,
            "title": "Titanic",
            "description": "In 1912, the Titanic embarks on its inevitable collision course with history. In the wake of the over-spending required to build the largest luxury ship in the world, White Star Line executive Sir Bruce Ismay schemes to reverse the direction of his company's plummeting stock value. Onboard the Titanic, brave German 1st Officer Petersen struggles to convince his self-important British superiors not to overexert the ship's engines.",
            "poster_path": "/Al7oIXQ4dZAofBTZWm6OiXS3MEa.jpg",
            "tmdb_id": 11021
        },
        {
            "id": 22,
            "title": "Titanic",
            "description": "In 1912, the Titanic embarks on its inevitable collision course with history. In the wake of the over-spending required to build the largest luxury ship in the world, White Star Line executive Sir Bruce Ismay schemes to reverse the direction of his company's plummeting stock value. Onboard the Titanic, brave German 1st Officer Petersen struggles to convince his self-important British superiors not to overexert the ship's engines.",
            "poster_path": "/Al7oIXQ4dZAofBTZWm6OiXS3MEa.jpg",
            "tmdb_id": 21
        }
    ]
}